app/controllers/assignments_controller.rb

  def index
    @assignments = Assignment.order(:name)
---
SELECT "assignments".* FROM "assignments" ORDER BY name

  def show
    @assignment = Assignment.find(params[:id])
    @groups = @assignment.groups.order(:created_at)
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "groups".* FROM "groups" WHERE "groups"."assignment_id" = 1 ORDER BY created_at

  def create
    @assignment = Assignment.create(params[:assignment])
    @assignments = Assignment.order(:name)
---
INSERT INTO "assignments" ("created_at", "groupsize", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 15 Mar 2013 00:05:31 UTC +00:00], ["groupsize", 2], ["name", "Rockr"], ["updated_at", Fri, 15 Mar 2013 00:05:31 UTC +00:00]]
SELECT "assignments".* FROM "assignments" ORDER BY name