app/controllers/students_controller.rb

SELECT "students".* FROM "students" ORDER BY name
---
  def index
    @students = Student.order(:name)

INSERT INTO "students" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Thu, 14 Mar 2013 23:32:41 UTC +00:00], ["name", "Bob"], ["updated_at", Thu, 14 Mar 2013 23:32:41 UTC +00:00]]
SELECT "students".* FROM "students" ORDER BY name
---
  def create
    @student = Student.create(params[:student])
    @students = Student.order(:name)